In [1]:
import pandas as pd
df=pd.read_csv("titanic.csv")
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [2]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df

     Survived  Pclass     Sex   Age     Fare
0           0       3    male  22.0   7.2500
1           1       1  female  38.0  71.2833
2           1       3  female  26.0   7.9250
3           1       1  female  35.0  53.1000
4           0       3    male  35.0   8.0500
..        ...     ...     ...   ...      ...
886         0       2    male  27.0  13.0000
887         1       1  female  19.0  30.0000
888         0       3  female   NaN  23.4500
889         1       1    male  26.0  30.0000
890         0       3    male  32.0   7.7500

[891 rows x 5 columns]

In [3]:
target=df.Survived
target

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [4]:
inputs=df.drop(['Survived'],axis='columns')
inputs

     Pclass     Sex   Age     Fare
0         3    male  22.0   7.2500
1         1  female  38.0  71.2833
2         3  female  26.0   7.9250
3         1  female  35.0  53.1000
4         3    male  35.0   8.0500
..      ...     ...   ...      ...
886       2    male  27.0  13.0000
887       1  female  19.0  30.0000
888       3  female   NaN  23.4500
889       1    male  26.0  30.0000
890       3    male  32.0   7.7500

[891 rows x 4 columns]

In [5]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [6]:
inputs=pd.concat([inputs,dummies],axis='columns')
inputs.drop(['Sex'],axis='columns',inplace=True) #inplace update the inputs DF
inputs.head(6)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1
5       3   NaN   8.4583       0     1

In [7]:
#find NA columns
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [8]:
#mean age to fill na age
import numpy as np
meanAge=np.mean(inputs.Age)
meanAge

29.69911764705882

In [9]:
#make mean age integer
import math
meanAge=math.floor(meanAge)
inputs.Age=inputs.Age.fillna(meanAge)
inputs.head(6)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1
5       3  29.0   8.4583       0     1

In [10]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(inputs,target,test_size=0.2)

In [11]:
len(X_train)

712

In [12]:
len(X_test)

179

In [13]:
len(inputs)

891

In [14]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [15]:
model.fit(X_train,y_train)

GaussianNB()

In [16]:
model.score(X_test,y_test)

0.8212290502793296

In [17]:
X_test[:5]

     Pclass   Age    Fare  female  male
234       2  24.0  10.500       0     1
62        1  45.0  83.475       0     1
280       3  65.0   7.750       0     1
289       3  22.0   7.750       1     0
510       3  29.0   7.750       0     1

In [18]:
y_test[:10]

234    0
62     0
280    0
289    1
510    1
855    1
744    1
295    0
613    0
325    1
Name: Survived, dtype: int64

In [19]:
model.predict(X_test[:10])

array([0, 0, 0, 1, 0, 1, 0, 0, 0, 1], dtype=int64)

In [22]:
model.predict_proba(X_test[:10])

array([[9.74262127e-01, 2.57378727e-02],
       [5.89074090e-01, 4.10925910e-01],
       [9.87540502e-01, 1.24594984e-02],
       [1.01665295e-01, 8.98334705e-01],
       [9.89660618e-01, 1.03393816e-02],
       [9.43179951e-02, 9.05682005e-01],
       [9.89931634e-01, 1.00683663e-02],
       [9.05662163e-01, 9.43378366e-02],
       [9.89660618e-01, 1.03393816e-02],
       [2.36108884e-05, 9.99976389e-01]])